# Commands

### Miscellaneous
```
SWITCH# show enpoint
SWITCH# show ip route
SWITCH# show lldp neighbors
```
```
APIC# ifconfig
APIC# show firmware upgrade status
APIC# acidiag avread
APIC# acidiag fnvread
APIC# acidiag run lldp tool in eth2-1
APIC# ifconfig
APIC# show switch
```
### Faults, Logging
```
APIC# show faults last-days 5 history
APIC# show faults leaf 101
APIC# show faults history leaf 101
```
### NTP
```
SWITCH# show ntp peer-status
APIC# htpstat
```
